Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_gpio_type.h
#ifndef _RTL8735B_GPIO_TYPE_H_
#define _RTL8735B_GPIO_TYPE_H_

/**************************************************************************//**
 * @defgroup GPIO_IT_STS
 * @brief  GPIO interrupt type status Register       (@ 0X000)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IT_STS                            0
#define GPIO_MASK_IT_STS                             ((u32)0x0000FFFF << 0)                              /*!<R 0  For each bit : 0: the specific GPIO pin is configured to edge sensitive interrupt mode 1: the specific GPIO pin is configured to levle sensitive interrupt mode. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_EI_EN
 * @brief  GPIO edge sensitive interrupt mode enable (@ 0X004)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_EI_EN                             0
#define GPIO_MASK_EI_EN                              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured to edge sensitive interrupt mode and also cause the corresponging bit of REG_GPIO_IT_STS to be read as 0. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_LI_EN
 * @brief  GPIO level sensitive interrupt mode enable (@ 0X008)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_LI_EN                             0
#define GPIO_MASK_LI_EN                              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as level sensitive interrupt mode and also cause the corresponging bit of REG_GPIO_IT_STS to be read as 1. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_IP_STS
 * @brief  GPIO interrupt polarity status            (@ 0X00C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IP_STS15                          30
#define GPIO_MASK_IP_STS15                           ((u32)0x00000003 << 30)                             /*!<R 0  The interrupt polarity status of GPIO15 */
#define GPIO_SHIFT_IP_STS14                          28
#define GPIO_MASK_IP_STS14                           ((u32)0x00000003 << 28)                             /*!<R 0  The interrupt polarity status of GPIO14 */
#define GPIO_SHIFT_IP_STS13                          26
#define GPIO_MASK_IP_STS13                           ((u32)0x00000003 << 26)                             /*!<R 0  The interrupt polarity status of GPIO13 */
#define GPIO_SHIFT_IP_STS12                          24
#define GPIO_MASK_IP_STS12                           ((u32)0x00000003 << 24)                             /*!<R 0  The interrupt polarity status of GPIO12 */
#define GPIO_SHIFT_IP_STS11                          22
#define GPIO_MASK_IP_STS11                           ((u32)0x00000003 << 22)                             /*!<R 0  The interrupt polarity status of GPIO11 */
#define GPIO_SHIFT_IP_STS10                          20
#define GPIO_MASK_IP_STS10                           ((u32)0x00000003 << 20)                             /*!<R 0  The interrupt polarity status of GPIO10 */
#define GPIO_SHIFT_IP_STS9                           18
#define GPIO_MASK_IP_STS9                            ((u32)0x00000003 << 18)                             /*!<R 0  The interrupt polarity status of GPIO9 */
#define GPIO_SHIFT_IP_STS8                           16
#define GPIO_MASK_IP_STS8                            ((u32)0x00000003 << 16)                             /*!<R 0  The interrupt polarity status of GPIO8 */
#define GPIO_SHIFT_IP_STS7                           14
#define GPIO_MASK_IP_STS7                            ((u32)0x00000003 << 14)                             /*!<R 0  The interrupt polarity status of GPIO7 */
#define GPIO_SHIFT_IP_STS6                           12
#define GPIO_MASK_IP_STS6                            ((u32)0x00000003 << 12)                             /*!<R 0  The interrupt polarity status of GPIO6 */
#define GPIO_SHIFT_IP_STS5                           10
#define GPIO_MASK_IP_STS5                            ((u32)0x00000003 << 10)                             /*!<R 0  The interrupt polarity status of GPIO5 */
#define GPIO_SHIFT_IP_STS4                           8
#define GPIO_MASK_IP_STS4                            ((u32)0x00000003 << 8)                              /*!<R 0  The interrupt polarity status of GPIO4 */
#define GPIO_SHIFT_IP_STS3                           6
#define GPIO_MASK_IP_STS3                            ((u32)0x00000003 << 6)                              /*!<R 0  The interrupt polarity status of GPIO3 */
#define GPIO_SHIFT_IP_STS2                           4
#define GPIO_MASK_IP_STS2                            ((u32)0x00000003 << 4)                              /*!<R 0  The interrupt polarity status of GPIO2 */
#define GPIO_SHIFT_IP_STS1                           2
#define GPIO_MASK_IP_STS1                            ((u32)0x00000003 << 2)                              /*!<R 0  The interrupt polarity status of GPIO1 */
#define GPIO_SHIFT_IP_STS0                           0
#define GPIO_MASK_IP_STS0                            ((u32)0x00000003 << 0)                              /*!<R 0  The interrupt polarity status of GPIO0 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_IR_EN
 * @brief  GPIO interrupt rising-edge enable         (@ 0X014)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IR_EN                             0
#define GPIO_MASK_IR_EN                              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation; 1: the conrtolled GPIO pin is configured to rising-edge interrupt mode or high-level mode (depends on REG_GPIO_IT_STS) and also cause the corresponding bits of REG_GPIO_IP_STS to be read as 00b. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_IF_EN
 * @brief  GPIO interrupt falling-edge enable        (@ 0X018)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IF_EN                             0
#define GPIO_MASK_IF_EN                              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation; 1: the conrtolled GPIO pin is configured to falling-edge interrupt mode or low-level interrupt mode (depends on REG_GPIO_IT_STS) and cause the corresponding bits of REG_GPIO_IP_STS to be read as 01b. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_ID_EN
 * @brief  GPIO interrupt dual-edge enable           (@ 0X01C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ID_EN                             0
#define GPIO_MASK_ID_EN                              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation; 1: the conrtolled GPIO pin is configured to dual-edge interrupt mode and also cause the corresponding bits of REG_GPIO_IP_STS to be read as 10b. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_IE_STS
 * @brief  GPIO interrupt enable status              (@ 0X020)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IE_STS                            0
#define GPIO_MASK_IE_STS                             ((u32)0x0000FFFF << 0)                              /*!<R 0  For each bit: 0: the interrupt of the specific GPIO pin is disabled 1: the interrupt of the specific GPIO pin is enabled */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_EN
 * @brief  GPIO interrupt enable                     (@ 0X024)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_EN                            0
#define GPIO_MASK_INT_EN                             ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: to enable the specific GPIO INT and also cause the specified bit of REG_GPIO_IE_STS to be read as ONE. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_DIS
 * @brief  GPIO interrupt disable                    (@ 0X028)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_DIS                           0
#define GPIO_MASK_INT_DIS                            ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: to disable the specified the GPIO INT and also cause the specified bit of REG_GPIO_IE_STS to be read as ZERO. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_RAW_STS
 * @brief  GPIO RAW interrupt status                 (@ 0X02C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_RAW_STS                       0
#define GPIO_MASK_INT_RAW_STS                        ((u32)0x0000FFFF << 0)                              /*!<R 0  For each bit: 0: the specified GPIO pin has no pending interrupt 1: the specified GPIO pin's interrupt is pending (permasking) */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_STS
 * @brief  GPIO interrupt status                     (@ 0X030)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_STS                           0
#define GPIO_MASK_INT_STS                            ((u32)0x0000FFFF << 0)                              /*!<R 0  For each bit: 0: the specified GPIO pin has no pending interrupt 1: the specified GPIO pin's interrupt is pending */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_CLR
 * @brief  GPIO interrupt status clear               (@ 0X034)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_CLR                           0
#define GPIO_MASK_INT_CLR                            ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit writting: 0: No operation; 1: Clear edge type pending interrupt of the conrtolled GPIO pin and clear the specified bits of REG_GPIO_INT_STS as ZERO */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_FUNC_EN_STS
 * @brief  GPIO interrupt function enable status     (@ 0X038)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_EN_STS                        0
#define GPIO_MASK_INT_EN_STS                         ((u32)0x0000FFFF << 0)                              /*!<R 0  For each bit: 0: the specified GPIO INT is Disable 1: the specified GPIO INT is Enable */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_FUNC_EN
 * @brief  GPIO interrupt function enable            (@ 0X03C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_EN                            0
#define GPIO_MASK_INT_EN                             ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the specified GPIO INT is enabled and also cause the specified bit of REG_GPIO_INT_FUNC_EN_STS to be read as ONE. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT_FUNC_DIS
 * @brief  GPIO interrupt function disable           (@ 0X040)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_DIS                           0
#define GPIO_MASK_INT_DIS                            ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the specified GPIO INT is disabled and also cause the specified bit of REG_GPIO_INT_FUNC_EN_STS to be read as ZERO. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT0_SEL
 * @brief  GPIO INT0 selection                       (@ 0X050)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT0 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT0 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT0 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT1_SEL
 * @brief  GPIO INT1 selection                       (@ 0X054)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT1 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT1 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT1 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT2_SEL
 * @brief  GPIO INT2 selection                       (@ 0X058)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT2 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT2 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT2 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT3_SEL
 * @brief  GPIO INT3 selection                       (@ 0X05C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT3 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT3 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT3 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT4_SEL
 * @brief  GPIO INT4 selection                       (@ 0X060)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT4 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT4 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT4 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT5_SEL
 * @brief  GPIO INT5 selection                       (@ 0X064)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT5 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT5 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT5 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT6_SEL
 * @brief  GPIO INT6 selection                       (@ 0X068)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT6 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT6 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT6 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT7_SEL
 * @brief  GPIO INT7 selection                       (@ 0X06C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT7 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT7 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT7 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT8_SEL
 * @brief  GPIO INT8 selection                       (@ 0X070)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT8 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT8 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT8 */
/** @} */

