Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_gpio_type.h
/**************************************************************************//**
 * @defgroup GPIO_INT9_SEL
 * @brief  GPIO INT9 selection                       (@ 0X074)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT9 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT9 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT9 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT10_SEL
 * @brief  GPIO INT10 selection                      (@ 0X078)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT10 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT10 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT10 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT11_SEL
 * @brief  GPIO INT11 selection                      (@ 0X07C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT11 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT11 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT11 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT12_SEL
 * @brief  GPIO INT12 selection                      (@ 0X080)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT12 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT12 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT12 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT13_SEL
 * @brief  GPIO INT13 selection                      (@ 0X084)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT13 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT13 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT13 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT14_SEL
 * @brief  GPIO INT14 selection                      (@ 0X088)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT14 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT14 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT14 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_INT15_SEL
 * @brief  GPIO INT15 selection                      (@ 0X08C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_INT_SUR_SEL                       15
#define GPIO_BIT_INT_SUR_SEL                         ((u32)0x00000001 << 15)                             /*!<R/W 0  0: Useing pin input signal as interrupt signal source 1: Using debounce output signal as interrupt signal source */
#define GPIO_SHIFT_INT_DEB_SEL                       8
#define GPIO_MASK_INT_DEB_SEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0  Debounce Output signal selection for GPIO INT15 */
#define GPIO_SHIFT_INT_GP_SEL                        5
#define GPIO_MASK_INT_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for GPIO INT15 */
#define GPIO_SHIFT_INT_MER_SEL                       0
#define GPIO_MASK_INT_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for GPIO INT15 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB_STS
 * @brief  GPIO port debounce status                 (@ 0X0F0)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_STS                           0
#define GPIO_MASK_DEB_STS                            ((u32)0x0000FFFF << 0)                              /*!<R 0  For each bit: 0: the specific GPIO debounce pin is DISABLE debounce 1: the specific GPIO debounce pin is ENABLE debounce */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB_EN
 * @brief  GPIO debounce pin enable                  (@ 0X0F4)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_EN                            0
#define GPIO_MASK_DEB_EN                             ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO de-bouncing pin is enabled and also cause the specified bit of REG_GPIO_DEB_STS to be read as ONE. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB_DIS
 * @brief  GPIO debounce pin disable                 (@ 0X0F8)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_DIS                           0
#define GPIO_MASK_DEB_DIS                            ((u32)0x0000FFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO de-bouncing pin is disabled and also cause the specified bit of REG_GPIO_DEB_STS to be read as ZERO. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB_DP_STS
 * @brief  GPIO debounce data pin status             (@ 0X0FC)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_DP_STS                        0
#define GPIO_MASK_DEB_DP_STS                         ((u32)0x0000FFFF << 0)                              /*!<R 0  For each bit reading: read the signal level of the specified pin after de-bounce */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB0_SEL
 * @brief  GPIO debounce0 selection                  (@ 0X100)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce0 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce0 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB1_SEL
 * @brief  GPIO debounce1 selection                  (@ 0X104)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce1 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce1 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB2_SEL
 * @brief  GPIO debounce2 selection                  (@ 0X108)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce2 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce2 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB3_SEL
 * @brief  GPIO debounce3 selection                  (@ 0X10C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce3 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce3 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB4_SEL
 * @brief  GPIO debounce4 selection                  (@ 0X110)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce4 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce4 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB5_SEL
 * @brief  GPIO debounce5 selection                  (@ 0X114)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce5 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce5 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB6_SEL
 * @brief  GPIO debounce6 selection                  (@ 0X118)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce6 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce6 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB7_SEL
 * @brief  GPIO debounce7 selection                  (@ 0X11C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce7 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce7 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB8_SEL
 * @brief  GPIO debounce8 selection                  (@ 0X120)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce8 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce8 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB9_SEL
 * @brief  GPIO debounce9 selection                  (@ 0X124)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce9 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce9 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB10_SEL
 * @brief  GPIO debounce10 selection                 (@ 0X128)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce10 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce10 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB11_SEL
 * @brief  GPIO debounce11 selection                 (@ 0X12C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce11 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce11 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB12_SEL
 * @brief  GPIO debounce12 selection                 (@ 0X130)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce12 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce12 */
/** @} */

