Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_gpio_type.h
/**************************************************************************//**
 * @defgroup GPIO_DEB13_SEL
 * @brief  GPIO debounce13 selection                 (@ 0X134)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce13 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce13 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB14_SEL
 * @brief  GPIO debounce14 selection                 (@ 0X138)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce14 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce14 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_DEB15_SEL
 * @brief  GPIO debounce15 selection                 (@ 0X13C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DEB_CYC                           8
#define GPIO_MASK_DEB_CYC                            ((u32)0x00003FFF << 8)                              /*!<R/W 0  The GPIO signal will be filtered by the number of debounce cycles given in this field. */
#define GPIO_SHIFT_DEB_GP_SEL                        5
#define GPIO_MASK_DEB_GP_SEL                         ((u32)0x00000003 << 5)                              /*!<R/W 0  GPIO port selection for debounce15 */
#define GPIO_SHIFT_DEB_MER_SEL                       0
#define GPIO_MASK_DEB_MER_SEL                        ((u32)0x0000001F << 0)                              /*!<R/W 0  Pin selection of specified port for debounce15 */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_DMD_STS
 * @brief  GPIO port A data mode direction status    (@ 0X200)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DMD_STS                           0
#define GPIO_MASK_DMD_STS                            ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specific GPIO pin is configured to INPUT data mode 1: the specific GPIO pin is configured to OUTPUT data mode */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_IDM_EN
 * @brief  GPIO port A input data mode enable        (@ 0X204)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IDM_EN                            0
#define GPIO_MASK_IDM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of the conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured to input data mode and also cause the specified bit of REG_PORT_A_DMD_STS to be read as zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_ODM_EN
 * @brief  GPIO port A output data mode enable       (@ 0X208)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODM_EN                            0
#define GPIO_MASK_ODM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured as output data mode and also cause the specified bit of REG_PORT_A_DMD_STS to be read as one */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_OD_STS
 * @brief  GPIO port A output data status            (@ 0X20C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_OD_STS                            0
#define GPIO_MASK_OD_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specified GPIO pin is configured as output low 1: the specified GPIO pin is configured as output high , if the specific GPIO pin is output data mode. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_ODL_EN
 * @brief  GPIO port A output data low enable        (@ 0X210)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODL_EN                            0
#define GPIO_MASK_ODL_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output low and also cause the specified bit of REG_PORT_A_OD_STS is zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_ODH_EN
 * @brief  GPIO port A output data high enable       (@ 0X214)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODH_EN                            0
#define GPIO_MASK_ODH_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output high and also cause the specified bit of REG_PORT_A_OD_STS is one. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_ODT_EN
 * @brief  GPIO port A output data toggle enable     (@ 0X218)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODT_EN                            0
#define GPIO_MASK_ODT_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: Toggle output of the conrtolled GPIO pin and the specified bit of REG_PORT_A_OD_STS also will be toggled. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_A_DP_STS
 * @brief  GPIO port A data pin status               (@ 0X21C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DP_STS                            0
#define GPIO_MASK_DP_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit reading: If the direction of the specified bit is input then read the signal level of the input pin. If the direction of the specified bit is output then reads the output data register for port A. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_DMD_STS
 * @brief  GPIO port B data mode direction status    (@ 0X240)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DMD_STS                           0
#define GPIO_MASK_DMD_STS                            ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specific GPIO pin is configured to INPUT data mode 1: the specific GPIO pin is configured to OUTPUT data mode */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_IDM_EN
 * @brief  GPIO port B input data mode enable        (@ 0X244)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IDM_EN                            0
#define GPIO_MASK_IDM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of the conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured to input data mode and also cause the specified bit of REG_PORT_B_DMD_STS to be read as zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_ODM_EN
 * @brief  GPIO port B output data mode enable       (@ 0X248)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODM_EN                            0
#define GPIO_MASK_ODM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of the conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured as output data mode and also cause the specified bit of REG_PORT_B_DMD_STS to be read as one */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_OD_STS
 * @brief  GPIO port B output data status            (@ 0X24C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_OD_STS                            0
#define GPIO_MASK_OD_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specified GPIO pin is configured as output low 1: the specified GPIO pin is configured as output high , if the specific GPIO pin is output data mode. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_ODL_EN
 * @brief  GPIO port B output data low enable        (@ 0X250)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODL_EN                            0
#define GPIO_MASK_ODL_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output low and also cause the specified bit of REG_PORT_B_OD_STS is zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_ODH_EN
 * @brief  GPIO port B output data high enable       (@ 0X254)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODH_EN                            0
#define GPIO_MASK_ODH_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output high and also cause the specified bit of REG_PORT_B_OD_STS is one. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_ODT_EN
 * @brief  GPIO port B output data toggle enable     (@ 0X258)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODT_EN                            0
#define GPIO_MASK_ODT_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: Toggle output of the conrtolled GPIO pin and the specified bit of REG_PORT_B_OD_STS also will be toggled. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_B_DP_STS
 * @brief  GPIO port B data pin status               (@ 0X25C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DP_STS                            0
#define GPIO_MASK_DP_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit reading: If the direction of the specified bit is input then read the signal level of the input pin. If the direction of the specified bit is output then reads the output data register for port B. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_DMD_STS
 * @brief  GPIO port C data mode direction status    (@ 0X280)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DMD_STS                           0
#define GPIO_MASK_DMD_STS                            ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specific GPIO pin is configured to INPUT data mode 1: the specific GPIO pin is configured to OUTPUT data mode */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_IDM_EN
 * @brief  GPIO port C input data mode enable        (@ 0X284)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IDM_EN                            0
#define GPIO_MASK_IDM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of the conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured to input data mode and also cause the specified bit of REG_PORT_C_DMD_STS to be read as zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_ODM_EN
 * @brief  GPIO port C output data mode enable       (@ 0X288)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODM_EN                            0
#define GPIO_MASK_ODM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of the conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured as output data mode and also cause the specified bit of REG_PORT_C_DMD_STS to be read as one */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_OD_STS
 * @brief  GPIO port C output data status            (@ 0X28C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_OD_STS                            0
#define GPIO_MASK_OD_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specified GPIO pin is configured as output low 1: the specified GPIO pin is configured as output high , if the specific GPIO pin is output data mode. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_ODL_EN
 * @brief  GPIO port C output data low enable        (@ 0X290)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODL_EN                            0
#define GPIO_MASK_ODL_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output low and also cause the specified bit of REG_PORT_C_OD_STS is zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_ODH_EN
 * @brief  GPIO port C output data high enable       (@ 0X294)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODH_EN                            0
#define GPIO_MASK_ODH_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output high and also cause the specified bit of REG_PORT_C_OD_STS is one. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_ODT_EN
 * @brief  GPIO port C output data toggle enable     (@ 0X298)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODT_EN                            0
#define GPIO_MASK_ODT_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: Toggle output of the conrtolled GPIO pin and the specified bit of REG_PORT_C_OD_STS also will be toggled. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_C_DP_STS
 * @brief  GPIO port C data pin status               (@ 0X29C)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DP_STS                            0
#define GPIO_MASK_DP_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit reading: If the direction of the specified bit is input then read the signal level of the input pin. If the direction of the specified bit is output then reads the output data register for port C. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_DMD_STS
 * @brief  GPIO port D data mode direction status    (@ 0X2C0)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DMD_STS                           0
#define GPIO_MASK_DMD_STS                            ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specific GPIO pin is configured to INPUT data mode 1: the specific GPIO pin is configured to OUTPUT data mode */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_IDM_EN
 * @brief  GPIO port D input data mode enable        (@ 0X2C4)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_IDM_EN                            0
#define GPIO_MASK_IDM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of the conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured to input data mode and also cause the specified bit of REG_PORT_D_DMD_STS to be read as zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_ODM_EN
 * @brief  GPIO port D output data mode enable       (@ 0X2C8)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODM_EN                            0
#define GPIO_MASK_ODM_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: the configuration of the conrtolled GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured as output data mode and also cause the specified bit of REG_PORT_D_DMD_STS to be read as one */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_OD_STS
 * @brief  GPIO port D output data status            (@ 0X2CC)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_OD_STS                            0
#define GPIO_MASK_OD_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit: 0: the specified GPIO pin is configured as output low 1: the specified GPIO pin is configured as output high , if the specific GPIO pin is output data mode. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_ODL_EN
 * @brief  GPIO port D output data low enable        (@ 0X2D0)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODL_EN                            0
#define GPIO_MASK_ODL_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output low and also cause the specified bit of REG_PORT_D_OD_STS is zero. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_ODH_EN
 * @brief  GPIO port D output data high enable       (@ 0X2D4)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODH_EN                            0
#define GPIO_MASK_ODH_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: the conrtolled GPIO pin is configured as output high and also cause the specified bit of REG_PORT_D_OD_STS is one. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_ODT_EN
 * @brief  GPIO port D output data toggle enable     (@ 0X2D8)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_ODT_EN                            0
#define GPIO_MASK_ODT_EN                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  For each bit write: 0: No operation 1: Toggle output of the conrtolled GPIO pin and the specified bit of REG_PORT_D_OD_STS also will be toggled. */
/** @} */

/**************************************************************************//**
 * @defgroup GPIO_PORT_D_DP_STS
 * @brief  GPIO port D data pin status               (@ 0X2DC)
 * @{
 *****************************************************************************/
#define GPIO_SHIFT_DP_STS                            0
#define GPIO_MASK_DP_STS                             ((u32)0xFFFFFFFF << 0)                              /*!<R 0  For each bit reading: If the direction of the specified bit is input then read the signal level of the input pin. If the direction of the specified bit is output then reads the output data register for port D. */
/** @} */

