Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_gpio_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_GPIO
 * @{
 * @brief rtl8735b_GPIO Register Declaration
 *****************************************************************************/
typedef struct {
	__I  uint32_t GPIO_IT_STS ;                            /*!<  GPIO interrupt type status Register register,  Address offset: 0x000 */
	__IO uint32_t GPIO_EI_EN ;                             /*!<  GPIO edge sensitive interrupt mode enable register,  Address offset: 0x004 */
	__IO uint32_t GPIO_LI_EN ;                             /*!<  GPIO level sensitive interrupt mode enable register,  Address offset: 0x008 */
	__I  uint32_t GPIO_IP_STS ;                            /*!<  GPIO interrupt polarity status register,  Address offset: 0x00C */
	__IO uint32_t RSVD0;                                  /*!<  Reserved,  Address offset:0x10 */
	__IO uint32_t GPIO_IR_EN ;                             /*!<  GPIO interrupt rising-edge enable register,  Address offset: 0x014 */
	__IO uint32_t GPIO_IF_EN ;                             /*!<  GPIO interrupt falling-edge enable register,  Address offset: 0x018 */
	__IO uint32_t GPIO_ID_EN ;                             /*!<  GPIO interrupt dual-edge enable register,  Address offset: 0x01C */
	__I  uint32_t GPIO_IE_STS ;                            /*!<  GPIO interrupt enable status register,  Address offset: 0x020 */
	__IO uint32_t GPIO_INT_EN ;                            /*!<  GPIO interrupt enable register,  Address offset: 0x024 */
	__IO uint32_t GPIO_INT_DIS ;                           /*!<  GPIO interrupt disable register,  Address offset: 0x028 */
	__I  uint32_t GPIO_INT_RAW_STS ;                       /*!<  GPIO RAW interrupt status register,  Address offset: 0x02C */
	__I  uint32_t GPIO_INT_STS ;                           /*!<  GPIO interrupt status register,  Address offset: 0x030 */
	__IO uint32_t GPIO_INT_CLR ;                           /*!<  GPIO interrupt status clear register,  Address offset: 0x034 */
	__I  uint32_t GPIO_INT_FUNC_EN_STS ;                   /*!<  GPIO interrupt function enable status register,  Address offset: 0x038 */
	__IO uint32_t GPIO_INT_FUNC_EN ;                       /*!<  GPIO interrupt function enable register,  Address offset: 0x03C */
	__IO uint32_t GPIO_INT_FUNC_DIS ;                      /*!<  GPIO interrupt function disable register,  Address offset: 0x040 */
	__IO uint32_t RSVD1[3];                                /*!<  Reserved,  Address offset:0x44-0x4C */
	__IO uint32_t GPIO_INT0_SEL ;                          /*!<  GPIO INT0 selection register,  Address offset: 0x050 */
	__IO uint32_t GPIO_INT1_SEL ;                          /*!<  GPIO INT1 selection register,  Address offset: 0x054 */
	__IO uint32_t GPIO_INT2_SEL ;                          /*!<  GPIO INT2 selection register,  Address offset: 0x058 */
	__IO uint32_t GPIO_INT3_SEL ;                          /*!<  GPIO INT3 selection register,  Address offset: 0x05C */
	__IO uint32_t GPIO_INT4_SEL ;                          /*!<  GPIO INT4 selection register,  Address offset: 0x060 */
	__IO uint32_t GPIO_INT5_SEL ;                          /*!<  GPIO INT5 selection register,  Address offset: 0x064 */
	__IO uint32_t GPIO_INT6_SEL ;                          /*!<  GPIO INT6 selection register,  Address offset: 0x068 */
	__IO uint32_t GPIO_INT7_SEL ;                          /*!<  GPIO INT7 selection register,  Address offset: 0x06C */
	__IO uint32_t GPIO_INT8_SEL ;                          /*!<  GPIO INT8 selection register,  Address offset: 0x070 */
	__IO uint32_t GPIO_INT9_SEL ;                          /*!<  GPIO INT9 selection register,  Address offset: 0x074 */
	__IO uint32_t GPIO_INT10_SEL ;                         /*!<  GPIO INT10 selection register,  Address offset: 0x078 */
	__IO uint32_t GPIO_INT11_SEL ;                         /*!<  GPIO INT11 selection register,  Address offset: 0x07C */
	__IO uint32_t GPIO_INT12_SEL ;                         /*!<  GPIO INT12 selection register,  Address offset: 0x080 */
	__IO uint32_t GPIO_INT13_SEL ;                         /*!<  GPIO INT13 selection register,  Address offset: 0x084 */
	__IO uint32_t GPIO_INT14_SEL ;                         /*!<  GPIO INT14 selection register,  Address offset: 0x088 */
	__IO uint32_t GPIO_INT15_SEL ;                         /*!<  GPIO INT15 selection register,  Address offset: 0x08C */
	__IO uint32_t RSVD2[24];                               /*!<  Reserved,  Address offset:0x90-0xEC */
	__I  uint32_t GPIO_DEB_STS ;                           /*!<  GPIO port debounce status register,  Address offset: 0x0F0 */
	__IO uint32_t GPIO_DEB_EN ;                            /*!<  GPIO debounce pin enable register,  Address offset: 0x0F4 */
	__IO uint32_t GPIO_DEB_DIS ;                           /*!<  GPIO debounce pin disable register,  Address offset: 0x0F8 */
	__I  uint32_t GPIO_DEB_DP_STS ;                        /*!<  GPIO debounce data pin status register,  Address offset: 0x0FC */
	__IO uint32_t GPIO_DEB0_SEL ;                          /*!<  GPIO debounce0 selection register,  Address offset: 0x100 */
	__IO uint32_t GPIO_DEB1_SEL ;                          /*!<  GPIO debounce1 selection register,  Address offset: 0x104 */
	__IO uint32_t GPIO_DEB2_SEL ;                          /*!<  GPIO debounce2 selection register,  Address offset: 0x108 */
	__IO uint32_t GPIO_DEB3_SEL ;                          /*!<  GPIO debounce3 selection register,  Address offset: 0x10C */
	__IO uint32_t GPIO_DEB4_SEL ;                          /*!<  GPIO debounce4 selection register,  Address offset: 0x110 */
	__IO uint32_t GPIO_DEB5_SEL ;                          /*!<  GPIO debounce5 selection register,  Address offset: 0x114 */
	__IO uint32_t GPIO_DEB6_SEL ;                          /*!<  GPIO debounce6 selection register,  Address offset: 0x118 */
	__IO uint32_t GPIO_DEB7_SEL ;                          /*!<  GPIO debounce7 selection register,  Address offset: 0x11C */
	__IO uint32_t GPIO_DEB8_SEL ;                          /*!<  GPIO debounce8 selection register,  Address offset: 0x120 */
	__IO uint32_t GPIO_DEB9_SEL ;                          /*!<  GPIO debounce9 selection register,  Address offset: 0x124 */
	__IO uint32_t GPIO_DEB10_SEL ;                         /*!<  GPIO debounce10 selection register,  Address offset: 0x128 */
	__IO uint32_t GPIO_DEB11_SEL ;                         /*!<  GPIO debounce11 selection register,  Address offset: 0x12C */
	__IO uint32_t GPIO_DEB12_SEL ;                         /*!<  GPIO debounce12 selection register,  Address offset: 0x130 */
	__IO uint32_t GPIO_DEB13_SEL ;                         /*!<  GPIO debounce13 selection register,  Address offset: 0x134 */
	__IO uint32_t GPIO_DEB14_SEL ;                         /*!<  GPIO debounce14 selection register,  Address offset: 0x138 */
	__IO uint32_t GPIO_DEB15_SEL ;                         /*!<  GPIO debounce15 selection register,  Address offset: 0x13C */
	__IO uint32_t RSVD3[48];                               /*!<  Reserved,  Address offset:0x140-0x1FC */
	__I  uint32_t GPIO_PORT_A_DMD_STS ;                    /*!<  GPIO port A data mode direction status register,  Address offset: 0x200 */
	__IO uint32_t GPIO_PORT_A_IDM_EN ;                     /*!<  GPIO port A input data mode enable register,  Address offset: 0x204 */
	__IO uint32_t GPIO_PORT_A_ODM_EN ;                     /*!<  GPIO port A output data mode enable register,  Address offset: 0x208 */
	__I  uint32_t GPIO_PORT_A_OD_STS ;                     /*!<  GPIO port A output data status register,  Address offset: 0x20C */
	__IO uint32_t GPIO_PORT_A_ODL_EN ;                     /*!<  GPIO port A output data low enable register,  Address offset: 0x210 */
	__IO uint32_t GPIO_PORT_A_ODH_EN ;                     /*!<  GPIO port A output data high enable register,  Address offset: 0x214 */
	__IO uint32_t GPIO_PORT_A_ODT_EN ;                     /*!<  GPIO port A output data toggle enable register,  Address offset: 0x218 */
	__I  uint32_t GPIO_PORT_A_DP_STS ;                     /*!<  GPIO port A data pin status register,  Address offset: 0x21C */
	__IO uint32_t RSVD4[8];                                /*!<  Reserved,  Address offset:0x220-0x23C */
	__I  uint32_t GPIO_PORT_B_DMD_STS ;                    /*!<  GPIO port B data mode direction status register,  Address offset: 0x240 */
	__IO uint32_t GPIO_PORT_B_IDM_EN ;                     /*!<  GPIO port B input data mode enable register,  Address offset: 0x244 */
	__IO uint32_t GPIO_PORT_B_ODM_EN ;                     /*!<  GPIO port B output data mode enable register,  Address offset: 0x248 */
	__I  uint32_t GPIO_PORT_B_OD_STS ;                     /*!<  GPIO port B output data status register,  Address offset: 0x24C */
	__IO uint32_t GPIO_PORT_B_ODL_EN ;                     /*!<  GPIO port B output data low enable register,  Address offset: 0x250 */
	__IO uint32_t GPIO_PORT_B_ODH_EN ;                     /*!<  GPIO port B output data high enable register,  Address offset: 0x254 */
	__IO uint32_t GPIO_PORT_B_ODT_EN ;                     /*!<  GPIO port B output data toggle enable register,  Address offset: 0x258 */
	__I  uint32_t GPIO_PORT_B_DP_STS ;                     /*!<  GPIO port B data pin status register,  Address offset: 0x25C */
	__IO uint32_t RSVD5[8];                                /*!<  Reserved,  Address offset:0x260-0x27C */
	__I  uint32_t GPIO_PORT_C_DMD_STS ;                    /*!<  GPIO port C data mode direction status register,  Address offset: 0x280 */
	__IO uint32_t GPIO_PORT_C_IDM_EN ;                     /*!<  GPIO port C input data mode enable register,  Address offset: 0x284 */
	__IO uint32_t GPIO_PORT_C_ODM_EN ;                     /*!<  GPIO port C output data mode enable register,  Address offset: 0x288 */
	__I  uint32_t GPIO_PORT_C_OD_STS ;                     /*!<  GPIO port C output data status register,  Address offset: 0x28C */
	__IO uint32_t GPIO_PORT_C_ODL_EN ;                     /*!<  GPIO port C output data low enable register,  Address offset: 0x290 */
	__IO uint32_t GPIO_PORT_C_ODH_EN ;                     /*!<  GPIO port C output data high enable register,  Address offset: 0x294 */
	__IO uint32_t GPIO_PORT_C_ODT_EN ;                     /*!<  GPIO port C output data toggle enable register,  Address offset: 0x298 */
	__I  uint32_t GPIO_PORT_C_DP_STS ;                     /*!<  GPIO port C data pin status register,  Address offset: 0x29C */
	__IO uint32_t RSVD6[8];                                /*!<  Reserved,  Address offset:0x2A0-0x2BC */
	__I  uint32_t GPIO_PORT_D_DMD_STS ;                    /*!<  GPIO port D data mode direction status register,  Address offset: 0x2C0 */
	__IO uint32_t GPIO_PORT_D_IDM_EN ;                     /*!<  GPIO port D input data mode enable register,  Address offset: 0x2C4 */
	__IO uint32_t GPIO_PORT_D_ODM_EN ;                     /*!<  GPIO port D output data mode enable register,  Address offset: 0x2C8 */
	__I  uint32_t GPIO_PORT_D_OD_STS ;                     /*!<  GPIO port D output data status register,  Address offset: 0x2CC */
	__IO uint32_t GPIO_PORT_D_ODL_EN ;                     /*!<  GPIO port D output data low enable register,  Address offset: 0x2D0 */
	__IO uint32_t GPIO_PORT_D_ODH_EN ;                     /*!<  GPIO port D output data high enable register,  Address offset: 0x2D4 */
	__IO uint32_t GPIO_PORT_D_ODT_EN ;                     /*!<  GPIO port D output data toggle enable register,  Address offset: 0x2D8 */
	__I  uint32_t GPIO_PORT_D_DP_STS ;                     /*!<  GPIO port D data pin status register,           Address offset: 0x2DC */
} GPIO_TypeDef;
/** @} */

#endif
